HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX0.75/WSPR-TX0.75.ino
  for (int i = 0; i < InString.length(); i++) {
    char c = InString.charAt(i);
    if (c < '0' || c > '9') break;
    y *= 10;
    y += (c - '0');
  }
  return y;
}

String  uint64ToStr (uint64_t p_InNumber, boolean p_LeadingZeros)
{
  char l_HighBuffer[7]; //6 digits + null terminator char
  char l_LowBuffer[7]; //6 digits + null terminator char
  char l_ResultBuffer [13]; //12 digits + null terminator char
  String l_ResultString = "";
  uint8_t l_Digit;

  sprintf(l_HighBuffer, "%06lu", p_InNumber / 1000000L); //Convert high part of 64bit unsigned integer to char array
  sprintf(l_LowBuffer, "%06lu", p_InNumber % 1000000L); //Convert low part of 64bit unsigned integer to char array
  l_ResultString = l_HighBuffer;
  l_ResultString = l_ResultString + l_LowBuffer; //Copy the 2 part result to a string

  if (!p_LeadingZeros) //If leading zeros should be removed
  {
    l_ResultString.toCharArray(l_ResultBuffer, 13);
    for (l_Digit = 0; l_Digit < 12; l_Digit++ )
    {
      if (l_ResultBuffer[l_Digit] == '0')
      {
        l_ResultBuffer[l_Digit] = ' '; // replace zero with a space character
      }
      else
      {
        break; //We have found all the leading Zeros, exit loop
      }
    }
    l_ResultString = l_ResultBuffer;
    l_ResultString.trim();//Remove all leading spaces
  }
  return l_ResultString;
}


void DoSignalGen ()
{
  CurrentMode = SignalGen;
  PickLP(BandNumOfHigestLP()); //Use the Low Pass filter that has the highest freq or is just a link
  freq = GadgetData.GeneratorFreq;
  si5351aSetFrequency(freq);
  digitalWrite(StatusLED, HIGH);
  SendAPIUpdate (UMesCurrentMode);
  SendAPIUpdate (UMesFreq);
}


void DoIdle ()
{
  PowerSaveOFF();
  CurrentMode = Idle;
  digitalWrite(StatusLED, LOW);
  si5351aOutputOff(SI_CLK0_CONTROL);
  SendAPIUpdate (UMesCurrentMode);
}


void DoWSPR ()
{
  // static double Lat;
  // static double Lon;
  PowerSaveOFF();  //Make sure GPS is not in sleep mode
  CurrentMode = WSPRBeacon;
  if (NoBandEnabled ()) {
    Serial.println (F("{MIN} Warning, configuration error, tranmission is not enabled on any band!"));
  }
  else
  {
    NextFreq();
    freq = freq + (100ULL * random (-100, 100)); //modify TX frequency with a random value beween -100 and +100 Hz
    si5351aOutputOff(SI_CLK0_CONTROL);
    SendAPIUpdate (UMesCurrentMode);

    //LOOP HERE FOREVER OR UNTIL INTERRUPTED BY A SERIAL COMMAND
    while (!Serial.available()) { //Do until incoming serial command
      while (gps.available( GPSSerial )) { //If GPS data available - process it
        fix = gps.read();
        if (Serial.available()) {// If serialdata was received on control port then abort and handle command
          DoIdle(); //Return to ideling
          return;
        }
        if (fix.valid.location && fix.valid.date && fix.valid.time)
        {
          GPSH = fix.dateTime.hours;
          GPSM = fix.dateTime.minutes;
          GPSS = fix.dateTime.seconds;
          if (GadgetData.WSPRData.LocatorOption == GPS) { //If GPS should update the Maidenhead locator
            //calcLocator (Lat, Lon);
            calcLocator (fix.latitude(), fix.longitude());
          }

          if ((GPSS == 0) && ((GPSM % 2) == 0))//If second is zero at even minute then start WSPR transmission
          {
            set_tx_buffer();// Encode the message in the transmit buffer
            GPSGoToSleep();//Put GPS to sleep to save power
            if (SendWSPRBlock () != 0) //Send a WSPR "Packet" for 1 minute and 50 seconds
            {
              DoIdle(); //Abort and start ideling as either the Call sign is not set (1) or a serial command interupted the transmission (2).
              return;
            }
            if (LastFreq ())  //If all bands have been transmitted on then pause for user defined time and after that start over on the first band again
            {
              if ((GadgetData.TXPause > 60) && (Product_Model == 1017)) //More than a 60 sec. of TX delay then do power saving (WSPR-TX Mini only)
              {
                delay (600); //Let the serial port send data from its buffer before we go to sleep
                Si5351PowerOff ();//Turn off the PLL to save power
                //PowerSaveON(); //Save power by putting the GPS to sleep and power off the Si5351 PLL during this long TX Paus
                //delay (1000UL * (GadgetData.TXPause - 30)); //Do noting until there is 30 seconds left of delay
                MCUGoToSleep (GadgetData.TXPause - 30);               //Set MCU in sleep mode until there is 30 seconds left of delay
                //smartdelay (1000UL * (GadgetData.TXPause - 30)); //Do noting until there is 30 seconds left of delay, update GUI every second
                PowerSaveOFF();// Turn on GPS and PLL again
                smartdelay(2000); // let the smartdelay routine read a few GPS lines so we can get the new GPS time after our sleep
              }
              else
              { //Not a long pause and not a Mini so do a regular pause after the tranmission for the legth of time the user has specified in the GUI
                smartdelay(GadgetData.TXPause * 1000UL); //Pause for the time set by the user
              }
            }
            GPSWakeUp();
            NextFreq();// get the frequency for the next HAM band that we will transmit on
            freq = freq + (100ULL * random (-100, 100)); //modify the TX frequency with a random value beween -100 and +100 Hz to avoid lengthy colisions with other users on the band
            smartdelay(3000);
          }
          else //We have GPS fix but it is not top of even minute so dubble-blink to indicate waiting for top of minute
          {
            SendAPIUpdate(UMesTime);
            if (GPSS < 57) //Send some nice-to-have info only if the WSPR start is at least 3 seconds away
            {
              SendAPIUpdate(UMesGPSLock);
              SendAPIUpdate(UMesLocator);
              SendSatData(); //Send Satellite postion and SNR information to the PC GUI
            }
            LEDBlink(2);
            smartdelay(200);
          }
        }
        else
        { //Waitng for GPS location fix
          SendSatData(); //Send Satellite postion and SNR information to the PC GUI, while we wait for the GPS location fix
          LEDBlink(1); //singelblink to indicate waiting for GPS Lock
          SendAPIUpdate(UMesNoGPSLock); //Send No lock status
          //GPSH = fix.dateTime.hours;
          //GPSM = fix.dateTime.minutes;
          //GPSS = fix.dateTime.seconds;
          SendAPIUpdate(UMesTime);    //Send GPS time
          smartdelay(400);
        }

      } //GPS serial data loop
    } //Incoming serial command
  }//Error, no band enabled
  DoIdle();// Go back to ideling
}


// Loop through the string, transmitting one character at a time.
int SendWSPRBlock()
{
  uint8_t i;
  unsigned long startmillis;
  unsigned long endmillis;
  boolean TXEnabled = true;
  int errcode;
  errcode = 0;


  //Abort if default Call Sign
  if ((GadgetData.WSPRData.CallSign[0] == 'A') && (GadgetData.WSPRData.CallSign[1] == 'A') && (GadgetData.WSPRData.CallSign[2] == '0') && (GadgetData.WSPRData.CallSign[3] == 'A') && (GadgetData.WSPRData.CallSign[4] == 'A') && (GadgetData.WSPRData.CallSign[5] == 'A')) //Do not actually key the transmitter if the callsign has not been changed from the default one AA0AAA
  {
    Serial.println(F("{MIN} Callsign is not changed from the default one, Transmit is disabled"));
    Serial.println(F("{MIN} Set your Callsign to enable transmission"));
    TXEnabled = false;
    errcode = 1;
  }
  if (errcode == 0)
  {
    // Send WSPR for two minutes
    digitalWrite(StatusLED, HIGH);
    startmillis = millis();
    for (i = 0; i < 162; i++)  //162 WSPR symbols to transmitt
    {
      endmillis = startmillis + ((i + 1) * (unsigned long) 683) ;   // Delay value for WSPR  delay is 683 milliseconds
      uint64_t tonefreq;
      tonefreq = freq + ((tx_buffer[i] * 146));  //~1.46 Hz  Tone spacing in centiHz
      if (TXEnabled) si5351aSetFrequency(tonefreq);
      //wait untill tone is transmitted for the correct amount of time
      while ((millis() < endmillis) && (!Serial.available())) ;//Until time is up or there is serial data received on the controll Serial port
      {
        //Do nothing, just wait
      }
      if (Serial.available()) // If serialdata was received on Controll port then abort and handle command
      {
        errcode = 2;
        break;
      }
    }
  }
  // Switches off Si5351a output
  si5351aOutputOff(SI_CLK0_CONTROL);
  digitalWrite(StatusLED, LOW);
  return errcode;
}

void set_tx_buffer()
{
  // Clear out the transmit buffer
  memset(tx_buffer, 0, sizeof(tx_buffer));
  jtencode.wspr_encode(GadgetData.WSPRData.CallSign, GadgetData.WSPRData.MaidenHead4, GadgetData.WSPRData.TXPowerdBm, tx_buffer);
}


//Maidenhead code from Ossi Väänänen https://ham.stackexchange.com/questions/221/how-can-one-convert-from-lat-long-to-grid-square
void calcLocator(double lat, double lon) {
  int o1, o2, o3;
  int a1, a2, a3;
  double remainder;
  // longitude
  remainder = lon + 180.0;
  o1 = (int)(remainder / 20.0);
  remainder = remainder - (double)o1 * 20.0;
  o2 = (int)(remainder / 2.0);
  //remainder = remainder - 2.0 * (double)o2;
  //o3 = (int)(12.0 * remainder);

  // latitude
  remainder = lat + 90.0;
  a1 = (int)(remainder / 10.0);
  remainder = remainder - (double)a1 * 10.0;
  a2 = (int)(remainder);
  //remainder = remainder - (double)a2;
  //a3 = (int)(24.0 * remainder);
  GadgetData.WSPRData.MaidenHead4[0] = (char)o1 + 'A';
  GadgetData.WSPRData.MaidenHead4[1] = (char)a1 + 'A';
  GadgetData.WSPRData.MaidenHead4[2] = (char)o2 + '0';
  GadgetData.WSPRData.MaidenHead4[3] = (char)a2 + '0';
  GadgetData.WSPRData.MaidenHead4[4] = 0;
}


